app/views/clients/index.html.erb

            <h6 class="client_projects_count">
              <%= t('client.projects_count', :count => client.projects.count.to_s) %>
---
SELECT `csm_clients`.* FROM `csm_clients`