app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT `csm_clients`.* FROM `csm_clients`