app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects` ORDER BY name
---
  def index
    @projects = Project.all

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 ORDER BY name LIMIT 1
---
  def show
    @project = Project.find(params[:id])

INSERT INTO `projects` (`client_id`, `created_at`, `description`, `end_date`, `finalized`, `name`, `updated_at`) VALUES (NULL, '2012-09-25 15:31:29', 'Descripcion de proyecto', '2013-01-01 00:00:00', 0, 'Proyecto', '2012-09-25 15:31:29')
---
  def create
    @project = Project.new(params[:project])

    #@project.client_id =  "1"

    respond_to do |format|
      if @project.save